backend-api/app/Controllers/Api/Auth.php

    public function login()
    {
        $json = $this->request->getJSON();
        $email = $json->email ?? $this->request->getVar('email');
        $password = $json->password ?? $this->request->getVar('password');

        if (empty($email) || empty($password)) {
            return $this->failUnauthorized('Email atau Password tidak boleh kosong.');
        }

        $model = new UserModel();
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'dasdad@dadad'
 LIMIT 1