backend-api/app/Controllers/Api/Pengaduan.php

    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pengaduan');
        $builder->select('pengaduan.*, users.username, kategori_aduan.nama_kategori');
        $builder->join('users', 'users.id = pengaduan.id_user', 'left');
        $builder->join('kategori_aduan', 'kategori_aduan.id = pengaduan.id_kategori', 'left');
        $builder->orderBy('pengaduan.tanggal_lapor', 'DESC');

        return $this->respond($builder->get()->getResult());
---
SELECT `pengaduan`.*, `users`.`username`, `kategori_aduan`.`nama_kategori`
FROM `pengaduan`
LEFT JOIN `users` ON `users`.`id` = `pengaduan`.`id_user`
LEFT JOIN `kategori_aduan` ON `kategori_aduan`.`id` = `pengaduan`.`id_kategori`
ORDER BY `pengaduan`.`tanggal_lapor` DESC